tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeater/system/topAir/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }

    p
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0.01;

        smoother         GaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    "(U|h|k|epsilon)"
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-08;
        relTol           0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell                0;
    pRefValue               100000;
}

relaxationFactors
{
    rho         1;
    p           0.7;
    U           0.3;
    h           0.7;
    nuTilda     0.7;
    k           0.7;
    epsilon     0.7;
    omega       0.7;
    "ILambda.*" 0.7;
}

// ************************************************************************* //
